<?php
/**
 * Created by PhpStorm.
 * User: Jaxson
 * Date: 2018/3/31
 * Time: 18:54
 */
$a = '{
(?:\n|\A)
				# 1: 打开标记
				(
					(?:~{3,}|`{3,}) # 捕获三个的波浪号/反引号
				)
				[ ]*
				(?:
					\.?([-_:a-zA-Z0-9]+) # 2: 独立类名(class属性)
				|
					\{((?:[ ]*[#.][-_:a-zA-Z0-9]+){1,})[ ]*\} # 3: 额外的属性
				)?
				
				\s?

				(?:
					\.?([-_:,a-zA-Z0-9]+) # 4: 语法高亮行数属性
				|
					\{((?:[ ]*[#.][-_:a-zA-Z0-9]+){1,})[ ]*\} # 5: 额外的属性
				)?
				
				\s?
				
				(?:
					\.?([-_:,a-zA-Z0-9]+) # 6: 指定某行高亮属性
				|
					\{((?:[ ]*[#.][-_:a-zA-Z0-9]+){1,})[ ]*\} # 7: 额外的属性
				)?
				
				[ ]* \n # 标记空格和换行符

				# 8: 内容
				(
					(?>
						(?!\1 [ ]* \n)	# 非标记关闭
						.*\n+
					)+
				)

				# 关闭标记
				\1 [ ]* (?= \n )
}xm';